---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReleaseConditions.Dispose
source: html/fa513b28-b6be-bb3c-58e0-ac35851eb21a.htm
---
# Autodesk.Revit.DB.Structure.ReleaseConditions.Dispose Method

Releases all resources used by the ReleaseConditions

## Syntax (C#)
```csharp
public void Dispose()
```